/*
1. Создайте функцию которая бы умела делать:
  minus(10)(6); // 4
  minus(5)(6); // -1
  minus(10)(); // 10
  minus()(6); // -6
  minus()(); // 0
  Подсказка, функция minus должна возвращать другую функцию.

2. Реализовать функцию, которая умножает и умеет запоминать возвращаемый результат между вызовами:
  function multiplyMaker ...
  const multiply = multiplyMaker(2);
  multiply(2); // 4 (2 * 2)
  multiply(1); // 4 (4 * 1)
  multiply(3); // 12 (4 * 3)
  multiply(10); // 120 (12 * 10)

3. Реализовать модуль, который работает со строкой и имеет методы:
  a. установить строку
  i. если передано пустое значение, то установить пустую строку
  ii. если передано число, число привести к строке
  b. получить строку
  c. получить длину строки
  d. получить строку-перевертыш
  Пример:
  модуль.установитьСтроку(‘abcde’);
  модуль.получитьСтроку(); // ‘abcde’
  модуль.получитьДлину(); // 5

  4. Создайте модуль “калькулятор”, который умеет складывать, умножать, вычитать, делить и возводить в степень. Конечное значение округлить до двух знаков после точки (значение должно храниться в обычной переменной, не в this).

  модуль.установитьЗначение(10); // значение = 10
  модуль.прибавить(5); // значение += 5
  модуль.умножить(2); // значение *= 2
  модуль.узнатьЗначение(); // вывести в консоль 30 (здесь надо округлить)

  Также можно вызывать методы цепочкой:
  модуль.установитьЗначение(10).вСтепень(2).узнатьЗначение(); // 100
*/


// 1
  function minus (num1 = 0) {
    return function (num2 = 0) {
      return num1 - num2;
    };
  }  
// ---------------------------------------------------------------------------------

// 2
function multiplyMaker (num = 0) {
  let number = num;
  return function (num2 = 0) {
    return number *= num2;    
  }
}
const multiply = multiplyMaker(2);
// ---------------------------------------------------------------------------------

// 3
  function modulStr () {
    let str; 
    return {
      setStr (arg = '') {        
        str = arg.toString();
      },
      getStr () {
        return str;
      },
      strLength () {
        return str.length;
      },
      strRevers() {
        return str.split('').reverse().join('');
      }            
    };
  }

  let str = modulStr();    
// ------------------------------------------------------------------------------------

// 4
  function getCalc () {
    let numb;
    return {
      startValue (arg = 0) {
        numb = arg;
        return this;
      },
      foldNumb (arg = 0) {
        numb += arg;
        return this;
      },
      multiplyNumb (arg = 0) {
       numb *= arg;
       return this;
      },
      getNumb () {
        return Math.round(numb);
      }
    };
  }

  let calc = getCalc();
  let decision = calc.startValue(10).foldNumb(5).multiplyNumb(2).getNumb();   
//-------------------------------------------------------------------------------------